In [2]:
import numpy as np
import scipy as sp
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn import tree
from sklearn.metrics import accuracy_score

In [5]:
df_bt = pd.read_csv('blocks_timestamps.csv') # Timestamps for each block
df_om = pd.read_csv('ordermatches_all.csv')  # Order details for each order (block)
df_pp = pd.read_csv('pepecash_prices.csv')   # USD value of pepecash over time (timeblock)
df_xp = pd.read_csv('xcp_prices.csv')        # USD value of xcp over time (timeblock)

In [6]:
df_bt

        Block   Timestamp
0      428925  1473387721
1      428926  1473388413
2      428927  1473391665
3      428928  1473391811
4      428929  1473393165
...       ...         ...
78260  507185  1517534266
78261  507186  1517535116
78262  507187  1517535355
78263  507188  1517535610
78264  507189  1517535635

[78265 rows x 2 columns]

In [7]:
df_om

        Block  ForwardAsset  ForwardQuantity BackwardAsset  BackwardQuantity
0      428940      RAREPEPE             1.00           XCP              2.00
1      429221  SHITCOINCARD           230.00           XCP             13.80
2      429221      RAREPEPE            10.00           XCP             15.00
3      429228  SHITCOINCARD             3.00           XCP              0.18
4      429228      RAREPEPE             1.00           XCP              1.50
...       ...           ...              ...           ...               ...
26033  507444      PEPECASH           600.00  KEKEVOLUTION              2.00
26034  507444     PIRATPEPE             5.00      PEPECASH           6000.00
26035  507444  SISTNCHAPEPE             3.00      PEPECASH           2025.00
26036  507447           XCP             0.75  SISTNCHAPEPE              1.00
26037  507452      KATYPEPE             5.00      PEPECASH            385.00

[26038 rows x 5 columns]

In [8]:
df_pp

      Timestamp     Price
0    1517558400  0.052494
1    1517472000  0.041177
2    1517385600  0.062411
3    1517299200  0.064185
4    1517212800  0.071138
..          ...       ...
486  1475478000  0.000069
487  1475391600  0.000069
488  1475305200  0.000037
489  1475218800  0.000084
490  1475132400  0.000092

[491 rows x 2 columns]

In [9]:
df_xp

      Timestamp  Price
0    1517558400  32.75
1    1517472000  33.52
2    1517385600  43.16
3    1517299200  44.83
4    1517212800  53.25
..          ...    ...
515  1473058800   3.55
516  1472972400   3.48
517  1472886000   3.57
518  1472799600   3.51
519  1472713200   3.25

[520 rows x 2 columns]

In [ ]:
# Need to throw out all data that isn't xcp or pepecash value

In [ ]:
df2_om = df_om
for row in df_om: